# ComponentRepeaterIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComponentRepeaterIterator Properties
ComponentRepeaterIterator Class See Also
---
The ComponentRepeaterIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace